; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v6 ?v9)
             (pred_4 ?v5 ?v1)
             (pred_2 ?v6 ?v1)
             (pred_3 ?v8 ?v6 )
	     (pred_6 ?v6)
             (pred_5 ?v4)
             (pred_10 ?v5)
             (pred_1 ?v1)
             (pred_7 ?v6)
             (pred_11 ?v5)
             (pred_9 ?v6)
             (pred_8 ))



(:action op_2
:parameters (?v7 ?v2 ?v12 ?v11)
:precondition (and (pred_5 ?v7) (pred_5 ?v2) (pred_10 ?v12) (pred_1 ?v11)
          (pred_12 ?v7 ?v2) (pred_4 ?v12 ?v11)
                   (pred_2 ?v2 ?v11) (pred_6 ?v7) 
                   (pred_7 ?v2) (pred_11 ?v12))
:effect (and  (pred_9 ?v2) (not (pred_7 ?v2))))


(:action op_5
:parameters (?v7 ?v13)
:precondition (and (pred_5 ?v7) (pred_5 ?v13)
               (pred_6 ?v7) (pred_12 ?v7 ?v13) (pred_9 ?v13))
:effect (and (pred_6 ?v13) (not (pred_6 ?v7))))

(:action op_3
:parameters (?v7 ?v12)
:precondition (and (pred_5 ?v7) (pred_10 ?v12) 
                  (pred_6 ?v7) (pred_3 ?v12 ?v7) (pred_8 ))
:effect (and (pred_11 ?v12)
   (not (pred_3 ?v12 ?v7)) (not (pred_8 ))))


(:action op_4
:parameters (?v7 ?v10 ?v3)
:precondition (and (pred_5 ?v7) (pred_10 ?v10) (pred_10 ?v3)
                  (pred_6 ?v7) (pred_11 ?v3) (pred_3 ?v10 ?v7))
:effect (and (pred_11 ?v10) (pred_3 ?v3 ?v7)
        (not (pred_11 ?v3)) (not (pred_3 ?v10 ?v7))))

(:action op_1
:parameters (?v7 ?v12)
:precondition (and (pred_5 ?v7) (pred_10 ?v12) 
                  (pred_6 ?v7) (pred_11 ?v12))
:effect (and (pred_8 ) (pred_3 ?v12 ?v7) (not (pred_11 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_06 obj_20 obj_11 obj_08 obj_05 obj_15 obj_16 obj_19 obj_01 obj_17 obj_03 obj_12 obj_07 obj_18 obj_14
    obj_09 obj_10
    obj_04 obj_02
    )

    (:init
       (pred_8)

       (pred_5 obj_13)
       (pred_5 obj_06)
       (pred_5 obj_20)
       (pred_5 obj_11)
       (pred_5 obj_08)
       (pred_5 obj_05)
       (pred_5 obj_15)
       (pred_5 obj_16)
       (pred_5 obj_19)
       (pred_5 obj_01)
       (pred_5 obj_17)
       (pred_5 obj_03)
       (pred_5 obj_12)
       (pred_5 obj_07)
       (pred_5 obj_18)
       (pred_5 obj_14)
       (pred_1 obj_09)
       (pred_1 obj_10)
       (pred_10 obj_04)
       (pred_10 obj_02)

       (pred_12 obj_13 obj_08)
       (pred_12 obj_13 obj_06)
       (pred_12 obj_06 obj_05)
       (pred_12 obj_06 obj_20)
       (pred_12 obj_06 obj_13)
       (pred_12 obj_20 obj_15)
       (pred_12 obj_20 obj_11)
       (pred_12 obj_20 obj_06)
       (pred_12 obj_11 obj_16)
       (pred_12 obj_11 obj_20)
       (pred_12 obj_08 obj_19)
       (pred_12 obj_08 obj_05)
       (pred_12 obj_08 obj_13)
       (pred_12 obj_05 obj_01)
       (pred_12 obj_05 obj_15)
       (pred_12 obj_05 obj_06)
       (pred_12 obj_05 obj_08)
       (pred_12 obj_15 obj_17)
       (pred_12 obj_15 obj_16)
       (pred_12 obj_15 obj_20)
       (pred_12 obj_15 obj_05)
       (pred_12 obj_16 obj_03)
       (pred_12 obj_16 obj_11)
       (pred_12 obj_16 obj_15)
       (pred_12 obj_19 obj_12)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_19 obj_08)
       (pred_12 obj_01 obj_07)
       (pred_12 obj_01 obj_17)
       (pred_12 obj_01 obj_05)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_17 obj_18)
       (pred_12 obj_17 obj_03)
       (pred_12 obj_17 obj_15)
       (pred_12 obj_17 obj_01)
       (pred_12 obj_03 obj_14)
       (pred_12 obj_03 obj_16)
       (pred_12 obj_03 obj_17)
       (pred_12 obj_12 obj_07)
       (pred_12 obj_12 obj_19)
       (pred_12 obj_07 obj_18)
       (pred_12 obj_07 obj_01)
       (pred_12 obj_07 obj_12)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_18 obj_17)
       (pred_12 obj_18 obj_07)
       (pred_12 obj_14 obj_03)
       (pred_12 obj_14 obj_18)
       (pred_7 obj_12)
       (pred_7 obj_03)
       (pred_2  obj_12 obj_09)
       (pred_2  obj_03 obj_10)
       (pred_9 obj_13)
       (pred_9 obj_06)
       (pred_9 obj_20)
       (pred_9 obj_11)
       (pred_9 obj_08)
       (pred_9 obj_05)
       (pred_9 obj_15)
       (pred_9 obj_16)
       (pred_9 obj_19)
       (pred_9 obj_01)
       (pred_9 obj_17)
       (pred_9 obj_07)
       (pred_9 obj_18)
       (pred_9 obj_14)

       (pred_4  obj_04 obj_09)
       (pred_4  obj_02 obj_10)
       (pred_3 obj_04 obj_16)
       (pred_3 obj_02 obj_14)
       (pred_6 obj_11)
    )

    (:goal (and
       (pred_3 obj_02 obj_05)
    ))
(:constraints
  (always (not (pred_6 obj_15)))
)
)

; plan
1. (op_5 obj_11 obj_16)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_16)
   goals met: 0 of 1
2. (op_3 obj_16 obj_04)
   deleted: (pred_3 obj_04 obj_16) (pred_8)
   added: (pred_11 obj_04)
   goals met: 0 of 1
3. (op_5 obj_16 obj_11)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_11)
   goals met: 0 of 1
4. (op_5 obj_11 obj_20)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_20)
   goals met: 0 of 1
5. (op_5 obj_20 obj_06)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_06)
   goals met: 0 of 1
6. (op_5 obj_06 obj_05)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_05)
   goals met: 0 of 1
7. (op_1 obj_05 obj_04)
   deleted: (pred_11 obj_04)
   added: (pred_8) (pred_3 obj_04 obj_05)
   goals met: 0 of 1
8. (op_5 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_01)
   goals met: 0 of 1
9. (op_5 obj_01 obj_17)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_17)
   goals met: 0 of 1
10. (op_5 obj_17 obj_18)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_18)
   goals met: 0 of 1
11. (op_5 obj_18 obj_14)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_14)
   goals met: 0 of 1
12. (op_3 obj_14 obj_02)
   deleted: (pred_3 obj_02 obj_14) (pred_8)
   added: (pred_11 obj_02)
   goals met: 0 of 1
13. (op_5 obj_14 obj_18)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_18)
   goals met: 0 of 1
14. (op_5 obj_18 obj_17)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_17)
   goals met: 0 of 1
15. (op_5 obj_17 obj_01)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_01)
   goals met: 0 of 1
16. (op_5 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 0 of 1
17. (op_4 obj_05 obj_04 obj_02)
   deleted: (pred_11 obj_02) (pred_3 obj_04 obj_05)
   added: (pred_11 obj_04) (pred_3 obj_02 obj_05)
   goals met: 1 of 1
